Autodesk.Revit.DB.WorksharingUtils.CreateNewLocal(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.ModelPath)
Takes a path to a central model and copies the model into a new local file for the current user.
sourcePath:
The path to the central model.
targetPath:
The path to put the new local file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The model is not workshared.
-or-
The central model has not fully enabled worksharing.
It must be opened and resaved to finish enabling worksharing.
-or-
The model is a local file.
-or-
The central model is not saved in the current Revit version.
-or-
The model is transmitted.
-or-
-or-
The specified filepath is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another user.
-or-
The central model is being accessed by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException:
The file or folder already exists and cannot be overwritten.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This functionality is not available in Revit LT.
-or-
File already exists!
-or-
Revit Server does not support local models.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2014

Autodesk.Revit.DB.WorksharingUtils.GetUserWorksetInfo(Autodesk.Revit.DB.ModelPath)
Gets information about user worksets in a workshared model file, without fully opening the file.
Remarks:
This method provides a preview of the user worksets available in a file, allowing an
application to look up the necessary workset ids and information to properly fill out a WorksetConfiguration
structure before opening or linking to this model.
path:
The path to the workshared model.
Returns:
Information about all the user worksets in the model.
The list is sorted by workset id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model are locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is missing.
-or-
The central model is corrupt or not an RVT file.
-or-
The model is not workshared.
-or-
The central model is overwritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model could not be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The Revit model specified by path doesn't exist.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The model could not be found at the specified path.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This functionality is not available in Revit LT.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2012